things did not work as planned,

```
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "atlantis"
        }
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "atlantis"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "atlantis"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "atlantis"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "atlantis"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "atlantis"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "atlantis"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.11.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "atlantis"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.12.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "atlantis"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.10.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = false
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "atlantis"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.vpc.aws_eip.nat[0]: Creating...
module.vpc.aws_vpc.this[0]: Creating...
module.vpc.aws_eip.nat[0]: Creation complete after 0s [id=eipalloc-0f7f1b8f6d43b02f3]
module.vpc.aws_vpc.this[0]: Creation complete after 2s [id=vpc-05aeb8645dec9deb2]
module.vpc.aws_route_table.public[0]: Creating...
module.vpc.aws_route_table.private[0]: Creating...
module.vpc.aws_internet_gateway.this[0]: Creating...
module.vpc.aws_subnet.private[1]: Creating...
module.vpc.aws_subnet.public[1]: Creating...
module.vpc.aws_subnet.public[0]: Creating...
module.vpc.aws_subnet.private[0]: Creating...
module.vpc.aws_route_table.public[0]: Creation complete after 1s [id=rtb-0de8248e0843ed27c]
module.vpc.aws_route_table.private[0]: Still creating... [10s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [10s elapsed]
module.vpc.aws_route_table.private[0]: Still creating... [20s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [20s elapsed]
module.vpc.aws_route_table.private[0]: Still creating... [30s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [30s elapsed]
module.vpc.aws_route_table.private[0]: Still creating... [40s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [40s elapsed]
module.vpc.aws_route_table.private[0]: Still creating... [50s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [50s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [1m0s elapsed]
module.vpc.aws_route_table.private[0]: Still creating... [1m0s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [1m10s elapsed]
module.vpc.aws_route_table.private[0]: Still creating... [1m10s elapsed]
module.vpc.aws_route_table.private[0]: Still creating... [1m20s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [1m20s elapsed]
module.vpc.aws_route_table.private[0]: Still creating... [1m30s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [1m30s elapsed]
module.vpc.aws_route_table.private[0]: Still creating... [1m40s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [1m40s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [1m50s elapsed]
module.vpc.aws_route_table.private[0]: Still creating... [1m50s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [2m0s elapsed]
module.vpc.aws_route_table.private[0]: Still creating... [2m0s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [2m10s elapsed]
module.vpc.aws_route_table.private[0]: Still creating... [2m10s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [2m20s elapsed]
module.vpc.aws_route_table.private[0]: Still creating... [2m20s elapsed]
module.vpc.aws_route_table.private[0]: Still creating... [2m30s elapsed]
module.vpc.aws_internet_gateway.this[0]: Still creating... [2m30s elapsed]
module.vpc.aws_route_table.private[0]: Creation complete after 2m38s [id=rtb-0e26f419ddc3a7949]
module.vpc.aws_internet_gateway.this[0]: Still creating... [2m40s elapsed]
module.vpc.aws_internet_gateway.this[0]: Creation complete after 2m41s [id=igw-0b9d493afea925e23]
module.vpc.aws_route.public_internet_gateway[0]: Creating...
module.vpc.aws_route.public_internet_gateway[0]: Creation complete after 0s [id=r-rtb-0de8248e0843ed27c1080289494]

Error: error creating subnet: InvalidParameterValue: Value (eu-west-1b) for parameter availabilityZone is invalid. Subnets can currently only be created in the following availability zones: us-east-1a, us-east-1b, us-east-1c, us-east-1d, us-east-1e, us-east-1f.
	status code: 400, request id: aba24581-9255-420c-94f2-4891b9e05c42

  on .terraform/modules/vpc/main.tf line 329, in resource "aws_subnet" "public":
 329: resource "aws_subnet" "public" {



Error: error creating subnet: InvalidParameterValue: Value (eu-west-1a) for parameter availabilityZone is invalid. Subnets can currently only be created in the following availability zones: us-east-1a, us-east-1b, us-east-1c, us-east-1d, us-east-1e, us-east-1f.
	status code: 400, request id: 5b290680-c468-4838-acf8-8a6e281428a1

  on .terraform/modules/vpc/main.tf line 329, in resource "aws_subnet" "public":
 329: resource "aws_subnet" "public" {



Error: error creating subnet: InvalidParameterValue: Value (eu-west-1a) for parameter availabilityZone is invalid. Subnets can currently only be created in the following availability zones: us-east-1a, us-east-1b, us-east-1c, us-east-1d, us-east-1e, us-east-1f.
	status code: 400, request id: 89c80b81-4a03-44de-90ba-1874134c0fca

  on .terraform/modules/vpc/main.tf line 357, in resource "aws_subnet" "private":
 357: resource "aws_subnet" "private" {



Error: error creating subnet: InvalidParameterValue: Value (eu-west-1b) for parameter availabilityZone is invalid. Subnets can currently only be created in the following availability zones: us-east-1a, us-east-1b, us-east-1c, us-east-1d, us-east-1e, us-east-1f.
	status code: 400, request id: ef615c25-2967-4bfa-aef3-e59418adbf5e

  on .terraform/modules/vpc/main.tf line 357, in resource "aws_subnet" "private":
 357: resource "aws_subnet" "private" {



```